スクリプト言語　変数宣言の時に形を宣言しない

フラグメンテーション　メモリやハードウェアで終了したプログラムを入れたり、消したりしていると空き容量がとびとびになっていて入れたいプログラムの容量が空き容量より大きくてが入れられない状態



メモリコンパクション　メモリのとびとびの空き容量を１つの空き容量に整理することで入らなかったプログラムが入るようになります

ガーベジコレクション　使っていないプログラムをメモリ開放して空き容量作る



でフラグメンテーション　ハードウェアのフラグメンテーションを直すこと

下の奴はすべてマークアップ言語（処理手順ではなく、文書を記述する）

ＸＭＬはＨＴＭＬのようにＷｅｂページで用いられるだけではなく、ほかの用途でも用いられる

ＳＧＭＬ　ＨＴＭＬ，ＸＭＬの書き方を定義する言語

ＸＨＴＭＬ　ＨＴＭＬを拡張したもので、ＸＭＬのルールで作成した言語



ＤＯＭ　javascriptでどこを変化させるか指定する

SOAP 異なるＰＣで動作するプログラムをネットワークでメッセージを介して連携するためのプロトコル。通信にＨＴＴＰ（ポート番号80),メッセージはXMLで書かれる

ＳＶＧ　PINGは点を集めた画像データだが、SVGはテント店を結んでできた線のデータ。拡大、縮小しても質は悪くならない。拡大、縮小したとき再度計算して画像作成

ＪＳＯＮ　プログラム間のデータ交換に用いる。Ajaxで使う。

{

  "name":"Sato"(nameキーにSatoが入ってる）

}

ＹＡＭＬ　アプリケーションの設定ファイルに用いる(-は配列。:で辞書）

emails:

  - taro@example.com

RSS Webサイトの更新情報を配信するための技術

CMS Webサイトを作ったり、管理したりできるシステム

Wiki 簡単にWebブラウザからWebページの発行、解除できるソフトウェア